# -*- coding: utf-8 -*-
"""
Created on Mon Apr 18 15:20:16 2016

@author: misha
"""

from tools.sr_lat2cyr2lat import *
from collections import Counter
import os, re


REFERENCES = {
"АПГС" : "<ref name='Слободан Пузовић – Братислав Грубач – Хам Иштван – Саша Маринковић – Јавор Рашајски – Биљана Ковачев – Ђорђе Томић – Жељко Станимировић – Марјан Никетић, Атлас птица грабљивица Србије'>Слободан Пузовић – Братислав Грубач – Хам Иштван – Саша Маринковић – Јавор Рашајски – Биљана Ковачев – Ђорђе Томић – Жељко Станимировић – Марјан Никетић, Атлас птица грабљивица Србије, Завод за заштиту природе Србије, Нови Београд – Нови Сад – Приштина – Ниш 2000.</ref>",
"АСК" : "<ref name='>Милош Кордић, Азбучник села Комоговине'>Милош Кордић, Азбучник села Комоговине, СКД Просвјета, Загреб 2014.</ref>",
"Арс. В." : "<ref name='Владан Арсенијевић, Јестаственица'>Владан Арсенијевић, Јестаственица (за учитељске и више девојачке школе), део 1, Зоологија, Нови Сад 1879.</ref>",
"Бар. П." : "<ref name='П. Баришић, Дивљач и лов у Босни и Херцеговини'>П. Баришић, Дивљач и лов у Босни и Херцеговини, Шумарски лист, орган хрват.-славонскога шумарскога друштва, бр. 2. год. IX, Загреб 1885, 57–61.</ref>",
"Бен. Е." : "<ref name='Емил Бенић, Обедска бара и њена главна фауна'>Емил Бенић, Обедска бара и њена главна фауна, Штампарија браће Јанковића, Сремска Митровица 1930.</ref>",
"Богд. Н." : "<ref name='Недељко Богдановић, Лексика у Белићевим Дијалектима источне и јужне Србије'>Недељко Богдановић, Лексика у Белићевим Дијалектима источне и јужне Србије, Годишњак за српски језик, год. XXVI, бр. 13, Филозофски факултет, Ниш 2013, 95–105.</ref>",
"Бре. В." : "<ref name='Вера Брежанчић, Орнитофаунистички резерват Хутово блато у светлу међународних конвенција'>Вера Брежанчић, Орнитофаунистички резерват Хутово блато у светлу међународних конвенција, Природа Војводине, бр. XII–XIV, Покрајински завод за заштиту природе, Нови Сад година?, 129–136.</ref>",
"Бру. С." : "<ref name='Спиридон Брусина, Орнитолошке биљешке за хрватску фауну'>Спиридон Брусина, Орнитолошке биљешке за хрватску фауну, Гласник Хрватскога наравословнога друштва, година III, бр. 1, Загреб 1888, 129–150.</ref>",
"Бује" : "<ref name='Ami Boué, La Turquie d'Europe, tome premier'>Ami Boué, La Turquie d'Europe, tome premier, Arthus Bertrand, Paris 1840.</ref>",
 "Вас. В. I" : "<ref name='Војислав Васић – Георг Џукић, Орнитолошки рад грофа Алојзија Фердинанда Марсилија (1658–1730)'>Војислав Васић – Георг Џукић, Орнитолошки рад грофа Алојзија Фердинанда Марсилија (1658–1730), Зборник за природне науке, бр. 53, Матица српска, Нови Сад 1977, 233–253.</ref>",
 "Вас. В. II" : "<ref name='В. Ф. Васић – Ј. Шоти, Преглед фауна птица Власинског језера и околине'>В. Ф. Васић – Ј. Шоти, Преглед фауна птица Власинског језера и околине, Биосистематика, вол. 6, бр. 1, Унија биолошких научних друштава Југославије, Земун 1980, 81–107.</ref>",
 "Вес. Д. I" : "<ref name='Драгутин Весели, Прољетна сеоба птица по Босни и Херцеговини год. 1898'>Драгутин Весели, Прољетна сеоба птица по Босни и Херцеговини год. 1898, Ловачки лист, бр. 4, Савез ловачких удружења на подручју Босне и Херцеговине, Сарајево 1940, 195–197.</ref>",
 "Вес. Д. II" : "<ref name='Драгутин Весели, Прољетна сеоба птица по Босни и Херцеговини год. 1898 (свршетак)'>Драгутин Весели, Прољетна сеоба птица по Босни и Херцеговини год. 1898 (свршетак), Ловачки лист, бр. 6, Савез ловачких удружења на подручју Босне и Херцеговине, Сарајево 1940, 286–291.</ref>",
 "Вес. Д. III" : "<ref name='Драгутин Весели, Јесења сеоба птица по Босни и Херцеговини год. 1897'>Драгутин Весели, Јесења сеоба птица по Босни и Херцеговини год. 1897, Ловачки лист, бр. 9, Савез ловачких удружења на подручју Босне и Херцеговине, Сарајево 1940, 424–430.</ref>",
 "Вес. Д. IV" : "<ref name='Драгутин Весели, Сеоба птица кроз Босну и Херцеговину, Ловачки лист'>Драгутин Весели, Сеоба птица кроз Босну и Херцеговину, Ловачки лист, бр. 6, Савез ловачких удружења Народне Републике Босне и Херцеговине, Сарајево 1948, 155–157.</ref>",
 "Вес. Д. V" : "<ref name='Драгутин Весели, Сове, Ловачки лист'>Драгутин Весели, Сове, Ловачки лист, бр. 1–2, Савез ловачких удружења Народне Републике Босне и Херцеговине, Сарајево 1949, 1–8.</ref>",
 "ВИЕЛ" : "<ref name='Велика илустрована енциклопедија ловства'>Велика илустрована енциклопедија ловства, Грађевинска књига – Дневник, Београд – Нови Сад, I 1991, II 1992.</ref>",
 "Виз. О." : "<ref name='Ондреј Визи, Заштићене животињске врсте у Црној Гори'>Ондреј Визи, Заштићене животињске врсте у Црној Гори, Гласник Републичког завода за заштиту природе и Природњачког музеја у Титограду, 17, Титоград 1984, 69–108.</ref>",
 "ВЛ" : "<ref name='Владалачки ловови (свршетак)'>Владалачки ловови (свршетак), Ловац, бр. 11–12, Савез ловачких удружења, Београд 1900, 161–166.</ref>",
 "Вод. М." : "<ref name='Мато Водопић, Попис пучкијех птичијих имена'>Мато Водопић, Попис пучкијех птичијих имена, Словинац, бр. 2, књ. III, Дубровник 1880, 30–33.</ref>",
 "Врање" : "",
 "Вуј. Ј." : "<ref name='Јоаким Вујић, Јестествословије'>Јоаким Вујић, Јестествословије, превод с немачког, Будим 1809.</ref>",
 "Вук" : "<ref name='Вук Стефановић Караџић, Српски рјечник'>Вук Стефановић Караџић, Српски рјечник, 4. издање, Штампарија Краљевине Југославије, Београд 1935.</ref>",
 "Вук. Ж." : "<ref name='Живко Вукасовић, Наравописје'>Живко Вукасовић, Наравописје. За порабу гимназијалних учионицах у Хрватској и Славонији, Загреб 1850.</ref>",
 "Гар. Б. I" : "<ref name='Борис Гаровников, Зимски гости наших ловишта'>Борис Гаровников, Зимски гости наших ловишта, Ловачке новине, бр. 1–2, Дневник, Нови Сад 1982, 18–20.</ref>",
 "Гар. Б. II" : "<ref name='Борис Гаровников – Милош Беуковић – Миленко Зеремски, Птице (перната дивљач) Дунавске бановине'>Борис Гаровников – Милош Беуковић – Миленко Зеремски, Птице (перната дивљач) Дунавске бановине, Ловачки савез Војводине, Нови Сад 2008.</ref>",
 "Гар. Б. III" : "<ref name='Борис Гаровников – Милош Беуковић – Миленко Зеремски, Које су то птице'>Борис Гаровников – Милош Беуковић – Миленко Зеремски, Које су то птице, Ловачки савез Војводине, Нови Сад 2009.</ref>",
 "Гар. Б. IV" : "<ref name='Миленко Зеремски – Борис Гаровников, Вишејезични именик пернате дивљачи'>Миленко Зеремски – Борис Гаровников, Вишејезични именик пернате дивљачи, Ловачки савез Војводине, Нови Сад 2010.</ref>",
 "Гаш. Б." : "<ref name='Бранислав Гашић, Птице Републике Српске'>Бранислав Гашић, Птице Републике Српске, Музеј Републике Српске, Бања Лука 1999.</ref>",
 "ГБК" : "<ref name='Драгољуб Петровић, Говор Баније и Кордуна'>Драгољуб Петровић, Говор Баније и Кордуна, Матица српска – Просвјета, Нови Сад – Загреб 1978.</ref>",
 "ГС" : "<ref name='Момчило Поповић – Драгољуб Петровић, О говору Спича: Грађа, Српски дијалектолошки зборник, књ. LVI'>Момчило Поповић – Драгољуб Петровић, О говору Спича: Грађа, Српски дијалектолошки зборник, књ. LVI, САНУ – Институт за српски језик САНУ, Београд 2009, 1–275.</ref>",
 "ГСРПП I и II" : "<ref name='Велимир Михајловић, Грађа за речник страних речи у предвуковском периоду, I том (А–Љ)'>Велимир Михајловић, Грађа за речник страних речи у предвуковском периоду, I том (А–Љ), Институт за лингвистику у Новом Саду, Нови Сад 1972, II том (М–Ш), Нови Сад 1974.</ref>",
"ГСРПП I" : "<ref name='Велимир Михајловић, Грађа за речник страних речи у предвуковском периоду, I том (А–Љ)'>Велимир Михајловић, Грађа за речник страних речи у предвуковском периоду, I том (А–Љ), Институт за лингвистику у Новом Саду, Нови Сад 1972, II том (М–Ш), Нови Сад 1974.</ref>",
"ГСРПП II" : "<ref name='Велимир Михајловић, Грађа за речник страних речи у предвуковском периоду, I том (А–Љ)'>Велимир Михајловић, Грађа за речник страних речи у предвуковском периоду, I том (А–Љ), Институт за лингвистику у Новом Саду, Нови Сад 1972, II том (М–Ш), Нови Сад 1974.</ref>",
 "Дев. М." : "<ref name='Милан Девић, Црна гуска – редак гост наше фауне, Ловачке новине, бр. 14'>Милан Девић, Црна гуска – редак гост наше фауне, Ловачке новине, бр. 14, Дневник, Нови Сад 1980, 9.</ref>",
 "Дел. В. I" : "<ref name='Велид Делић, Запажања о сеоби птица, Ловачки лист, бр. 6'>Велид Делић, Запажања о сеоби птица, Ловачки лист, бр. 6, Савез ловачких удружења Народне Републике Босне и Херцеговине, Сарајево 1957, 364–370.</ref>",
 "Дел. В. II" : "<ref name='Велид Делић, О сеоби птица, Ловачки лист, бр. 6'>Велид Делић, О сеоби птица, Ловачки лист, бр. 6, Савез ловачких удружења Народне Републике Босне и Херцеговине, Сарајево 1958, 327–334.</ref>",
 "Десп. П." : "<ref name='Август Либен, Природопис, први део: Зоологија'>Август Либен, Природопис, први део: Зоологија (превео П. Деспотовић), Панчево 1874.</ref>",
 "Док. Л." : "<ref name='Лазар Ђ. Докић, Аналитички и систематски преглед животиња у Краљевини Србији, I део'>Лазар Ђ. Докић, Аналитички и систематски преглед животиња у Краљевини Србији, I део, Кичмењаци, Краљевско-српска државна штампарија, Београд 1883.</ref>",
 "Домбр. Е." : "<ref name='Ернест Домбровски, Основи орнитологије сјеверозападне Србије'>Ернест Домбровски, Основи орнитологије сјеверозападне Србије, Гласник земаљског музеја у Босни и Херцеговини, књ. VII, Сарајево 1895, 63–104.</ref>",
 "Дусл Ј." : "<ref name='Јосиф Дусл, Зоологија за средње школе'>Јосиф Дусл, Зоологија за средње школе, Београд 1870.</ref>",
 "Ђур. С. I" : "<ref name='Стјепан Ђурашин, Птице'>Стјепан Ђурашин, Птице, књ. XXIV, дио први, Матица хрватска, Загреб 1899.</ref>",
 "Ђур. С. II" : "<ref name='Стјепан Ђурашин, Птице, књ. XXVI, дио други'>Стјепан Ђурашин, Птице, књ. XXVI, дио други, Матица хрватска, Загреб 1901.</ref>",
 "Еле. Г. I" : "<ref name='Гл. Елезовић, Соколари и соколарство'>Гл. Елезовић, Соколари и соколарство, Стара Србија, Скопље 1923.</ref>",
 "Еле. Г. II" : "<ref name='Глигорије Глиша Елезовић, Речник косовско-метохиског дијалекта'>Глигорије Глиша Елезовић, Речник косовско-метохиског дијалекта, Графички уметнички завод „Планета”, Београд, свеска прва 1932, свеска друга 1935.</ref>",
 "Ети. Ј." : "<ref name='Јосип Етингер, Сријемско-славонско-хрватске дивје животиње, звијери и птице'>Јосип Етингер, Сријемско-славонско-хрватске дивје животиње, звијери и птице, Тискарница Игњата Карла Сопрона, Земун 1857.</ref>",
 "Запл. Р." : "<ref name='Рудолф Заплата, Птице уловљене у Сарајеву и околини од 1880–1940. године'>Рудолф Заплата, Птице уловљене у Сарајеву и околини од 1880–1940. године, Ловачки лист, Савез ловачких удружења на подручју Босне и Херцеговине, Сарајево 1940, бр. 3, 141–143, бр. 4, 192–194, бр. 5, 232–234, бр. 6, 278–280, бр. 7, 333–335, бр. 8, 386–388, бр. 10, 474–477, бр. 11, 534–537, 1941, бр. 2, 84–86, бр. 3, 134–136.</ref>",
 "ЗБГ" : "<ref name='Збирка Бранислава Гашића.'>Збирка Бранислава Гашића.</ref>",
 "ЗНД" : "<ref name='Збирка Ненада Дучића'>Збирка Ненада Дучића.</ref>",
 "ЗППС" : "<ref name='Слободан Пузовић – Горан Секулић – Никола Стојнић – Братислав Грубач – Марко Туцаков, Значајна подручја за птице у Србији'>Слободан Пузовић – Горан Секулић – Никола Стојнић – Братислав Грубач – Марко Туцаков, Значајна подручја за птице у Србији, Министарство животне средине и просторног планирања – Завод за заштиту природе Србије – Покрајински секретаријат за заштиту животне средине и одрживи развој, Београд 2009.</ref>",
 "ЗТН" : "<ref name='Зоолошка терминологија и номенклатура. Средњошколска терминологија и номенклатура, књ. II, св. 2'>Зоолошка терминологија и номенклатура. Средњошколска терминологија и номенклатура, књ. II, св. 2, Министарство просвете Краљевине Југославије, Београд 1932.</ref>",
 "Ива. Б." : "<ref name='Божина Ивановић, Нека орнитолошка запажања на Скадарском језеру'>Божина Ивановић, Нека орнитолошка запажања на Скадарском језеру, Lаrus, вол. 21–22, годишњак Завода за Орнитологију ЈАЗУ, Загреб година? 1970 (24) (1967-68 21-22?), 137–160.</ref>",
 "Јед." : "<ref name='Ф. Берж (F. Berge), Цивилизација животиња (превео Св. Попадић)'>Ф. Берж (F. Berge), Цивилизација животиња (превео Св. Попадић), Јединство, бр. 147, Београд 5. јул 1873, 294.</ref>",
 "Јов. В." : "<ref name='Војкан Јовановић, Гуске, Зов, бр. 20'>Војкан Јовановић, Гуске, Зов, бр. 20, Борба, Београд 1984, 12–13.</ref>",
 "Кад. Х." : "<ref name='Hans von Kadich, Hundert Tage im Hinterland (Eine ornithologische Forschungsreise in der Hercegowina)'>Hans von Kadich, Hundert Tage im Hinterland (Eine ornithologische Forschungsreise in der Hercegowina), Mittheilungen des Ornithologischen Vereins in Wien, Wien 1887, 6–14, 23–25, 39–41, 61–63, 71–72, 85–86, 102–105, 121–123, 139–140, 154–157.</ref>",
 "Кап. М." : "<ref name='Мехмедалија Капетановић, Птице рибњака Саничани, Природа, бр. 6'>Мехмедалија Капетановић, Птице рибњака Саничани, Природа, бр. 6, Загреб 1970, 176–177.</ref>",
 "Кла. В. I" : "<ref name='Вјекослав Клаић, Природни земљопис Хрватске, књ. I'>Вјекослав Клаић, Природни земљопис Хрватске, књ. I, Матица хрватска, Загреб 1878.</ref>",
 "Кла. В. II" : "<ref name='Вјекослав Клаић, Босна (земљопис), књ. III'>Вјекослав Клаић, Босна (земљопис), књ. III, Матица хрватска, Загреб 1878.</ref>",
 "Кне. М." : "<ref name='Милан Кнежевић, Државно резервисано ловиште у Босни и Херцеговини, Ловачко-рибарски вјесник, бр. 2'>Милан Кнежевић, Државно резервисано ловиште у Босни и Херцеговини, Ловачко-рибарски вјесник, бр. 2, Хрватско друштво за гојење лова и рибарства, Загреб 1933, 35–47..</ref>",
 "Кне. Р." : "<ref name='Ратко Кнежевић, О тамањењу штетне дивљачи у ловиштима НР Босне и Херцеговине, Ловачки лист, бр. 6'>Ратко Кнежевић, О тамањењу штетне дивљачи у ловиштима НР Босне и Херцеговине, Ловачки лист, бр. 6, Савез ловачких друштава Народне Републике Босне и Херцеговине, Сарајево 1953, 321–358.</ref>",
 "Кос. В." : "<ref name='Валтазар Косић, Грађа за дубровачку номенклатуру и фауну птица, Гласник Хрватскога наравословнога друштва, година III, бр. 1'>Валтазар Косић, Грађа за дубровачку номенклатуру и фауну птица, Гласник Хрватскога наравословнога друштва, година III, бр. 1, Загреб 1888, 118–128.</ref>",
 "Лаз. Г." : "<ref name='Григорије Лазић, Проста наравна историја'>Григорије Лазић, Проста наравна историја, Будим 1836.</ref>",
 "ЛВ" : "<ref name='Рада Стијовић, Из лексике Васојевића, Српски дијалектолошки зборник'>Рада Стијовић, Из лексике Васојевића, Српски дијалектолошки зборник, XXXVI, САНУ, Београд 1990.</ref>",
 "ЛЗЛФ" : "<ref name='Вукоман Шелмић – Драган Гачић, Ловство са заштитом ловне фауне'>Вукоман Шелмић – Драган Гачић, Ловство са заштитом ловне фауне, Шумарски факултет, Београд 2011.</ref>",
 "Линт. Д." : "<ref name='Lintia Dénes, Adatok Szerbia madárfaunájához (први део)'>Lintia Dénes, Adatok Szerbia madárfaunájához (први део), Aquila (A magyar királyi ornithologiai központ folyóirata), XXII évfolyam, Budapest 1915, 329‒351. и Adatok Szerbia madárfaunájához (други део), Aquila (A magyar királyi ornithologiai központ folyóirata), XXIII évfolyam, Budapest 1916, 74‒162.</ref>",
 "ЛК" : "<ref name='Драгољуб Петровић ‒ Јелена Капустина, Из лексике Качера.'>Драгољуб Петровић ‒ Јелена Капустина, Из лексике Качера. ‒ Српски дијалектолошки зборник, LVIII, САНУ, Београд 2011.</ref>",
 "Лов." : "<ref name='Зоран А. Ристић, Ловство'>Зоран А. Ристић, Ловство, Астон, Крагујевац 2008.</ref>",
 "ЛР" : "<ref name='Драгослав Манић Форски, Лужнички речник'>Драгослав Манић Форски, Лужнички речник, Дом културе Бабушница, Бабушница 1997.</ref>",
 "Мар. В." : "<ref name='Вук Маринковић, Јестествена повестница'>Вук Маринковић, Јестествена повестница, Београд 1851.</ref>",
 "Марч. М. I" : "<ref name='Милорад Марчетић, Дивље патке'>Милорад Марчетић, Дивље патке, Војвођански ловац, бр. 92–93, Нови Сад 1955, 93–94.</ref>",
 "Марч. М. II" : "<ref name='Милорад Марчетић, Заштита птица на територији Војводине'>Милорад Марчетић, Заштита птица на територији Војводине, Заштита природе, бр. 7, Београд 1956, 5–11.</ref>",
 "Марч. М. III" : "<ref name='Милорад Марчетић, Дивље гуске у фауни птица Војводине'>Милорад Марчетић, Дивље гуске у фауни птица Војводине, Војвођански ловац, бр. 9–10, Нови Сад 1956, 155.</ref>",
 "Марч. М. IV" : "<ref name='Милорад Марчетић, Сове Strigidae, Зборник за природне науке, бр. 11'>Милорад Марчетић, Сове Strigidae, Зборник за природне науке, бр. 11, Матица српска, Нови Сад 1956, 167–178.</ref>",
 "Марч. М. V" : "<ref name='Милорад Марчетић, Орнитофауна Лудошког језера'>Милорад Марчетић, Орнитофауна Лудошког језера, Палићког језера и околине, Зборник за природне науке, бр. 11, Матица српска, Нови Сад 1956, 179–183.</ref>",
 "Марч. М. VI" : "<ref name='Милорад Марчетић, Дивље патке у слици и речи,'>Милорад Марчетић, Дивље патке у слици и речи, Војвођански ловац, бр. 11–12, Нови Сад 1958, 202–203.</ref>",
 "Марч. М. VII" : "<ref name='Милорад Марчетић, Дивље гуске у нашим крајевима, Војвођански ловац, бр. 11–12,'>Милорад Марчетић, Дивље гуске у нашим крајевима, Војвођански ловац, бр. 11–12, Нови Сад 1958, 204–205.</ref>",
 "Марч. М. VIII" : "<ref name='Милорад Марчетић, Наши ретки гости – лабудови, Војвођански ловац, бр. 1–2'>Милорад Марчетић, Наши ретки гости – лабудови, Војвођански ловац, бр. 1–2, Нови Сад 1959, 12–13.</ref>",
 "Марч. М. IX" : "<ref name='Милорад Марчетић – Душан Н. Андрејевић, Орнитофауна Косова и Метохије'>Милорад Марчетић – Душан Н. Андрејевић, Орнитофауна Косова и Метохије, Рилиндја, Приштина 1960.</ref>",
 "Матв. С. I" : "<ref name='Сергије Д. Матвејев, Српска имена птица, Архив билошких наука, бр. 2'>Сергије Д. Матвејев, Српска имена птица, Архив билошких наука, бр. 2, Институт за екологију и биогeографију Српске академије наука, Београд 1950, 146–158.</ref>",
 "Матв. С. II" : "<ref name='Сергије Д. Матвејев, Распрострањење и живот птица у Србији, Посебна издања САНУ, књ. CLXI'>Сергије Д. Матвејев, Распрострањење и живот птица у Србији, Посебна издања САНУ, књ. CLXI, Институт за екологију и биогеографију, књ. 3, Београд 1950.</ref>",
 "Матв. С. III" : "<ref name='Сергије Д. Матвејев, Преглед фауне птица Балканског полуострва, I део'>Сергије Д. Матвејев, Преглед фауне птица Балканског полуострва, I део, Детлићи и птице певачице, Посебна издања САНУ, књ. CDXCI, Одељење природно-математичких наука, књ. 46, Београд 1976.</ref>",
 "Мат. С. I" : "<ref name='Свет. К. Матић, Орнитолошка збирка у нишкој гимназији'>Свет. К. Матић, Орнитолошка збирка у нишкој гимназији, Извештај гимназије, Ниш 1905, 28–32.</ref>",
 "Мат. С. II" : "<ref name='Свет. К. Матић, Птице у околини Ниша, Извештај гимназије'>Свет. К. Матић, Птице у околини Ниша, Извештај гимназије, Ниш 1906, 48–53.</ref>",
 "Мед. М. I" : "<ref name='Мојо Медић, Принос народној терминологији биљака и животиња'>Мојо Медић, Принос народној терминологији биљака и животиња, Летопис Матице српске, књ. 139, свеска трећа, Матица српска, Нови Сад 1884, 85–100.</ref>",
 "Мед. М. II" : "<ref name='Мојо Медић, Додатак природописној и медицинској номенклатури, Летопис Матице српске, књ. 159'>Мојо Медић, Додатак природописној и медицинској номенклатури, Летопис Матице српске, књ. 159, свеска трећа, Матица српска, Нови Сад 1889, 123–135.</ref>",
 "Мед. М. III" : "<ref name='Мојо Медић, Додатак природописној и медицинској номенклатури (свршетак), Летопис Матице српске, књ. 160'>Мојо Медић, Додатак природописној и медицинској номенклатури (свршетак), Летопис Матице српске, књ. 160, свеска четврта, Матица српска, Нови Сад 1889, 70–91.</ref>",
 "Мед. М. IV" : "<ref name='Мојо Медић, Грађа за природописну номенклатуру и за рибарско оруђе, Летопис Матице српске, књ. 166'>Мојо Медић, Грађа за природописну номенклатуру и за рибарско оруђе, Летопис Матице српске, књ. 166, свеска друга, Матица српска, Нови Сад 1889, 60–81.</ref>",
 "Мед. М. V" : "<ref name='Мојо Медић, Други додатак грађи за природописну номенклатуру и за рибарско оруђе, Летопис Матице српске, књ. 184'>Мојо Медић, Други додатак грађи за природописну номенклатуру и за рибарско оруђе, Летопис Матице српске, књ. 184, свеска четврта, Матица српска, Нови Сад 1895, 13–27.</ref>",
 "Мед. М. VI" : "<ref name='Мојо Медић, Други додатак грађи за природописну номенклатуру и за рибарско оруђе (свршетак), Летопис Матице српске, књ. 188'>Мојо Медић, Други додатак грађи за природописну номенклатуру и за рибарско оруђе (свршетак), Летопис Матице српске, књ. 188, свеска четврта, Матица српска, Нови Сад 1895, 120–134.</ref>",
 "Мед. М. VII" : "<ref name='Мојо Медић, Зоологија за више разреде средњих школа'>Мојо Медић, Зоологија за више разреде средњих школа, Краљевска хрватско-славонска земаљска влада, Загреб 1920.</ref>",
 "Мил. П." : "<ref name='Пера Милић, Орнитолошке занимљивости из околине Новог Сада'>Пера Милић, Орнитолошке занимљивости из околине Новог Сада, Војвођански ловац, бр. 3–6, Нови Сад 1959, 72–74.</ref>",
 "НГ" : "<ref name='Милорад Марчетић, Наше грабљивице'>Милорад Марчетић, Наше грабљивице, Војвођански ловац, Савез ловачких друштава Војводине, Нови Сад 1953, бр. 72–73, 32–34, бр. 72–75, 34–36, 1954, бр. 76–77, 22–23.</ref>",
 "НИПБХ" : "<ref name='Отмар Рајзер ‒ Иван Сеуник, Народна имена птица у Босни и Херцеговини'>Отмар Рајзер ‒ Иван Сеуник, Народна имена птица у Босни и Херцеговини, Гласник земаљског музеја у Босни и Херцеговини, књ. I, Сарајево 1890, 109‒112.</ref>",
 "НПВ" : "<ref name='Рихард Чорнаи, Номенклатура птица Војводине'>Рихард Чорнаи, Номенклатура птица Војводине (од бр. 25–26 Номенклатура птица у Војводини), Војвођански ловац, Савез ловачких друштава Војводине, Нови Сад 1947, бр. 16, 215–216, бр. 17, 233–234, бр. 18–19, 259–260, 1948, бр. 21–22, 296–297, бр. 23–24, 330, бр. 25–26, 355–356, бр. 27–28, 381–382, бр. 29–30, 407–408, бр. 31, 428–429, 1949, бр. 32–34, 453–454, бр. 35–37, 487–489, бр. 38–41, 513–514, бр. 42–43, 543–545, 1950, бр. 47–49, 593–594, 1952, бр. 56–57, 16–17, бр. 58–59, 13–14, бр. 61, 14–15, бр. 62–63, 23–24, 1953, бр. 64–65, 23–24, бр. 66–67, 20–21, бр. 68–69, 24–25, бр. 70–71, 17–18.</ref>",
 "Орф. З." : "<ref name='Захарија Орфелин, Мелодија к пролећу'>Захарија Орфелин, Мелодија к пролећу, Нови Сад 1765.</ref>",
 "Ост. А." : "<ref name='А. Остојић, Прилог за народну номенклатуру'>А. Остојић, Прилог за народну номенклатуру, Гласник Хрватскога наравословнога друштва, година II, бр. 1, Загреб 1887, 119–129.</ref>",
 "ОЦБ" : "<ref name='Борис Гаровников – Естер Поповић, Орнитофауна Царске баре'>Борис Гаровников – Естер Поповић, Орнитофауна Царске баре, Природа Војводине, IX–XI, Покрајински завод за заштиту природе, Нови Сад 1986, 39–54.</ref>",
 "Панч. Ј. I" : "<ref name='Јосиф Панчић, Јестаственица'>Јосиф Панчић, Јестаственица (за ученике велике школе), део 1, Зоологија, Државна штампарија, Београд 1864.</ref>",
 "Панч. Ј. II" : "<ref name='Јосиф Панчић, Птице у Србији'>Јосиф Панчић, Птице у Србији, Државна штампарија, Београд 1867.</ref>",
 "ПАп" : "<ref name=''>Јован Лакатош, Птице Апатина, Глас комуне, Апатин 1979.</ref>",
 "ПБан" : "<ref name='Јован Лакатош, Птице Апатина'>Јавор Рашајски – Андреи Киш (Andrei Kiss), Птице Баната, Градски музеј Вршац, Вршац 2004.</ref>",
 "ПБар" : "<ref name='Бранислав Гашић – Горан Дујаковић, Птице Бардаче'>Бранислав Гашић – Горан Дујаковић, Птице Бардаче, Републички завод за заштиту културно-историјског и природног насљеђа Републике Српске, Бања Лука 2009.</ref>",
"ПБС" : "<ref name='Растко Александров, Птице Божја створења'>Растко Александров, Птице Божја створења, Штампарија Српске патријаршије, Београд 1993.</ref>",
"ПВП" : "<ref name='Јавор Рашајски – Иштван Пеле (Istvan Pelle), Птице Вршачких планина'>Јавор Рашајски – Иштван Пеле (Istvan Pelle), Птице Вршачких планина, Матица српска, Нови Сад 1993.</ref>",
"ПГБач" : "<ref name='Радивој Обрадовић, Птице грабљивице Бачке'>Радивој Обрадовић, Птице грабљивице Бачке, Еколошко друштво Апатин, Апатин 1994.</ref>",
"ПДКТ" : "<ref name='Војислав Васић – Саша Маринковић – Ондреј Визи, Птице Дурмитора и кањона Таре, Фауна Дурмитора, св. 3'>Војислав Васић – Саша Маринковић – Ондреј Визи, Птице Дурмитора и кањона Таре, Фауна Дурмитора, св. 3, ЦАНУ, Титоград 1990, 9–70.</ref>",
"ПДП" : "<ref name='Михаило Вучковић – Ондреј Визи, Прилог проучавању орнитофауне Црне Горе (птице долине Пиве)'>Михаило Вучковић – Ондреј Визи, Прилог проучавању орнитофауне Црне Горе (птице долине Пиве), Глас. Републичког завода зашт. природе – Природњачког музеја, 10, Титоград 1977, 41–58.</ref>",
"Пек. Б." : "<ref name='Божидар Пекић, Прилог познавању орнитофауне Царске Баре са околином, Заштита природе, бр. 14'>Божидар Пекић, Прилог познавању орнитофауне Царске Баре са околином, Заштита природе, бр. 14, Београд 1958, 11–19.</ref>",
"Петр. Б." : "<ref name='Борис Петров, Орнитофенолошки извештај из околине Прокупља, прештампано из Ловца, бр. 1–2'>Борис Петров, Орнитофенолошки извештај из околине Прокупља, прештампано из Ловца, бр. 1–2, Савез ловачких удружења, Београд 1941.</ref>",
"Петр. Ј." : "<ref name='Јован Петровић, Наука о животињама, Платонова штампарија,'>Јован Петровић, Наука о животињама, Платонова штампарија, Нови Сад 1867.</ref>",
"Пец. Ј." : "<ref name='Јосиф Пецић, Наука о животињама, Краљевско-српска државна штампарија'>Јосиф Пецић, Наука о животињама, Краљевско-српска државна штампарија, Београд 1884.</ref>",
"ПЗас" : "<ref name='Димитрије Радишић – Марко Шћибан – Милан Ружић – Михајло Станковић, Птице Засавице'>Димитрије Радишић – Марко Шћибан – Милан Ружић – Михајло Станковић, Птице Засавице, Покрет горана Сремске Митровице, Сремска Митровица 2010.</ref>",
"ПЈуг 1" : "<ref name='В. Е. Мартино – С. Д. Матвејев, Птице Југославије, I'>В. Е. Мартино – С. Д. Матвејев, Птице Југославије, I, Скупљање, препарирање и одређивање, Просвета, Београд 1947.</ref>",
"ПЈуг 2" : "<ref name='Радивој Обрадовић, Птице Југославије'>Радивој Обрадовић, Птице Југославије, Сомбор 1998.</ref>",
"ПКоп" : "<ref name='Сергије Д. Матвејев, Птице Копаоника'>Сергије Д. Матвејев, Птице Копаоника, Завод за заштиту природе Србије – Јавно предузеће „Национални парк Копаоник”, Београд 1997.</ref>",
"ПЛик" : "<ref name='Радивој Обрадовић, Птице Лике'>Радивој Обрадовић, Птице Лике, Еколошко друштво Горње Подунавље – Гимназија Никола Тесла, Апатин 1995.</ref>",
"ПОВ I и II" : "<ref name='Велимир Михајловић, Посрбице од Орфелина до Вука, I том (Б–О)'>Велимир Михајловић, Посрбице од Орфелина до Вука, I том (Б–О), Матица српска, Нови Сад 1982, II том (П–Ш), Нови Сад 1984.</ref>",
"ПОВ I" : "<ref name='Велимир Михајловић, Посрбице од Орфелина до Вука, I том (Б–О)'>Велимир Михајловић, Посрбице од Орфелина до Вука, I том (Б–О), Матица српска, Нови Сад 1982, II том (П–Ш), Нови Сад 1984.</ref>",
"ПОВ II" : "<ref name='Велимир Михајловић, Посрбице од Орфелина до Вука, I том (Б–О)'>Велимир Михајловић, Посрбице од Орфелина до Вука, I том (Б–О), Матица српска, Нови Сад 1982, II том (П–Ш), Нови Сад 1984.</ref>",
"Понг. Р. В." : "<ref name='Р. В. Понграц, Стрвинари пред објективом, Ловачки гласник, бр. 9–10'>Р. В. Понграц, Стрвинари пред објективом, Ловачки гласник, бр. 9–10, Савез ловачких удружења за Дунавску бановину, Нови Сад 1936, 258–262.</ref>",
"Поп. Ј." : "<ref name='Јелена Поповић, Еколошка инвентаризација орнитофауне у кањону реке Увац'>Јелена Поповић, Еколошка инвентаризација орнитофауне у кањону реке Увац, сепарат, Зборник радова Републичког завода за заштиту природе СР Србије, књ. 2, бр. 4, Београд 1974.</ref>",
"ПСВВ" : "<ref name='Јосиф Валдхер, Фауна.'>Јосиф Валдхер, Фауна. ‒ Повесница слободне краљеве вароши Вршца, Панчево 1886, 234‒239.</ref>",
"ПСрб" : "<ref name='Јавор Рашајски, Птице Србије'>Јавор Рашајски, Птице Србије, Triton Public, Вршац 2004.</ref>",
"ПХС I" : "<ref name='Спиро Брусина, Птице хрватско-српске, Споменик, I'>Спиро Брусина, Птице хрватско-српске, Споменик, I, Српска краљевска академија, Београд 1888.</ref>",
"ПХС II" : "<ref name='Спиро Брусина, Птице хрватско-српске, Споменик, XII'>Спиро Брусина, Птице хрватско-српске, Споменик, XII, Српска краљевска академија, Београд 1892.</ref>",
"Рајз. О. I" : "<ref name='Отмар Рајзер, Пребивања четирију врста европских лешинара у Босни и Херцеговини'>Отмар Рајзер, Пребивања четирију врста европских лешинара у Босни и Херцеговини, Гласник земаљског музеја у Босни и Херцеговини, књ. I, Сарајево 1889, 51–57.</ref>",
"Рајз. О. II" : "<ref name='Отмар Рајзер, Гдје у Босни и Херцеговини има дојако опажаних врста из рода патака (Anatidae) и куда се шире'>Отмар Рајзер, Гдје у Босни и Херцеговини има дојако опажаних врста из рода патака (Anatidae) и куда се шире, Гласник земаљског музеја у Босни и Херцеговини, књ. IV, Сарајево 1889, 119–125.</ref>",
"Рајз. О. III" : "<ref name='Отмар Рајзер, Додатак к списку птица у Босни и Херцеговини, Гласник земаљског музеја у Босни и Херцеговини, књ. II'>Отмар Рајзер, Додатак к списку птица у Босни и Херцеговини, Гласник земаљског музеја у Босни и Херцеговини, књ. II, Сарајево 1891, 262–263.</ref>",
"Рајз. О. IV" : "<ref name='Oтмар Рајзер – Иван Кнотек, Резултати посматрања сеобе птица по Босни и Херцеговини, Гласник земаљског музеја у Босни и Херцеговини, књ. XII'>Oтмар Рајзер – Иван Кнотек, Резултати посматрања сеобе птица по Босни и Херцеговини, Гласник земаљског музеја у Босни и Херцеговини, књ. XII, Сарајево 1900, 275–411.</ref>",
"Рајз. О. V" : "<ref name='Отмар Рајзер, Извјештај о успјеху орнитолошких путовања у Србији године 1899. и 1900, Гласник земаљског музеја у Босни и Херцеговини, књ. XVI'>Отмар Рајзер, Извјештај о успјеху орнитолошких путовања у Србији године 1899. и 1900, Гласник земаљског музеја у Босни и Херцеговини, књ. XVI, Сарајево 1904, 125–152.</ref>",
"Рашк. М. Н. I" : "<ref name='М. Н. Рашковић, Један прилог за упознавање тичијег света у Врањском округу, Ловац, бр. 8'>М. Н. Рашковић, Један прилог за упознавање тичијег света у Врањском округу, Ловац, бр. 8, Савез ловачких удружења, Београд 1897, 59.</ref>",
"Рашк. М. Н. II" : "<ref name='М. Н. Рашковић, Један прилог за упознавање тичијег света у Врањском округу (наставак), Ловац, бр. 9'>М. Н. Рашковић, Један прилог за упознавање тичијег света у Врањском округу (наставак), Ловац, бр. 9, Савез ловачких удружења, Београд 1897, 66.</ref>",
"Рашк. М. Н. III" : "<ref name='М. Н. Рашковић, Један прилог за упознавање тичијег света у Врањском округу (наставак), Ловац, бр. 12'>М. Н. Рашковић, Један прилог за упознавање тичијег света у Врањском округу (наставак), Ловац, бр. 12, Савез ловачких удружења, Београд 1897, 90–91.</ref>",
"Рашк. М. Н. IV" : "<ref name='Михаило Н. Рашковић, Дропљица, Ловац, бр. 3 и 4'>Михаило Н. Рашковић, Дропљица, Ловац, бр. 3 и 4, Савез ловачких удружења, Београд 1898, 18–19.</ref>",
"Рашк. М. Н. V" : "<ref name='Михаило Н. Рашковић, О тичијем свету у Крајини'>Михаило Н. Рашковић, О тичијем свету у Крајини, Први конгрес српских лекара и природњака, Београд 1905.</ref>",
"РГЗ" : "<ref name='Драго Ћупић ‒ Жељко Ћупић, Речник говора Загарача.'>Драго Ћупић ‒ Жељко Ћупић, Речник говора Загарача. ‒ Српски дијалектолошки зборник, XLIV, САНУ, Београд 1997.</ref>",
"РГЈК" : "<ref name='Радмила Жугић, Речник говора јабланичког краја'>Радмила Жугић, Речник говора јабланичког краја, Српски дијалектолошки зборник, LII, САНУ, Београд 2005.</ref>",
"РДГ" : "<ref name='Михаило Бојанић ‒ Растислава Тривунац, Рјечник дубровачког говора'>Михаило Бојанић ‒ Растислава Тривунац, Рјечник дубровачког говора, Српски дијалектолошки зборник, XLIX, САНУ, Београд 2002.</ref>",
"РЈС" : "<ref name='Момчило Златановић, Речник говора јужне Србије'>Момчило Златановић, Речник говора јужне Србије, Врањске књиге, Врање 2008.</ref>",
"РЈАЗУ" : "",
"РК" : "<ref name='Драгољуб Петровић – Ивана Ћелић – Јелена Капустина, Речник Куча'>Драгољуб Петровић – Ивана Ћелић – Јелена Капустина, Речник Куча, Српски дијалектолошки зборник, LX, САНУ – Институт за српски језик САНУ, Београд 2013.</ref>",
"РЛГ" : "<ref name='Бранислав Митровић, Речник лесковачког говора'>Бранислав Митровић, Речник лесковачког говора, Ленекс, Београд 1992.</ref>",
"РМС" : "<ref name='Речник српскохрватскога књижевног језика, књ. 1–6'>Речник српскохрватскога књижевног језика, књ. 1–6, Матица српска, Нови Сад 1967–1976.</ref>",
"РНГЦР I" : "<ref name='Миодраг Марковић, Речник народног говора у Црној Реци.'>Миодраг Марковић, Речник народног говора у Црној Реци. – Српски дијалектолошки зборник, XXXII, САНУ, Београд 1986.</ref>",
"РНГЦР II" : "<ref name='Миодраг Марковић, Речник народног говора у Црној Реци.'>Миодраг Марковић, Речник народног говора у Црној Реци. – Српски дијалектолошки зборник, XXXIX, САНУ, Београд 1993.</ref>",
"РСГВ" : "<ref name='Речник српских говора Војводине, св. 1–10'>Речник српских говора Војводине, св. 1–10, Матица српска, Нови Сад 2000–2010.</ref>",
"РПГ-Ж" : "<ref name='Новица Живковић, Речник пиротског говора'>Новица Живковић, Речник пиротског говора, Музеј Понишавља, Пирот 1987.</ref>",
"РПГ-З" : "<ref name='Драгољуб Златковић, Речник пиротског говора'>Драгољуб Златковић, Речник пиротског говора, Службени гласник, Београд 2014.</ref>",
"РСАНУ" : "<ref name='Речник српскохрватског књижевног и народног језика, књ. I–XIX'>Речник српскохрватског књижевног и народног језика, књ. I–XIX, Институт за српскохрватски језик САН / Институт за српски језик САНУ, Београд 1959–2014.</ref>",
"РСК I" : "<ref name='Властимир Јовановић, Речник села Каменице код Ниша'>Властимир Јовановић, Речник села Каменице код Ниша, Српски дијалектолошки зборник, књ. LI, САНУ – Институт за српски језик САНУ, Београд 2004, 313–688.</ref>",
"РСК II" : "<ref name='Властимир Јовановић, Додатак Речнику села Каменице код Ниша'>Властимир Јовановић, Додатак Речнику села Каменице код Ниша, Српски дијалектолошки зборник, књ. LIV, САНУ – Институт за српски језик САНУ, Београд 2007, 403–520.</ref>",
"РСН" : "<ref name='Ђорђе Поповић, Речник српскога и немачкога језика, II српско-немачки део'>Ђорђе Поповић, Речник српскога и немачкога језика, II српско-немачки део, непромењено друго прегледано и умножено издање, књижара „Напредак” из Панчева, Београд 1926.</ref>",
"Руцн. Д." : "<ref name='Драгутин Руцнер, Прилог познавању народне номенклатуре птица с подручја Конавала (Далмација)'>Драгутин Руцнер, Прилог познавању народне номенклатуре птица с подручја Конавала (Далмација), Larus, вол. 21–22, годишњак Завода за Орнитологију ЈАЗУ, Загреб 1970, 195–196.</ref>",
"Себ. Ђ. I" : "<ref name='Ђуро Себишановић, Грађа за номенклатуру наших птица'>Ђуро Себишановић, Грађа за номенклатуру наших птица, Гласник Хрватскога наравословнога друштва, година IV, бр. 1, Загреб 1889, 261–272.</ref>",
"Себ. Ђ. II" : "<ref name='Ђуро Себишановић, Орнитолошка вијест из вараждинског краја за годину 1889'>Ђуро Себишановић, Орнитолошка вијест из вараждинског краја за годину 1889, Гласник Хрватскога наравословнога друштва, година IV, бр. 1, Загреб 1889, 312–315.</ref>",
"Сев. А." : "<ref name='Александар Северјанин, Северни гости, Ловац, бр. 3–4'>Александар Северјанин, Северни гости, Ловац, бр. 3–4, Савез ловачких удружења, Београд 1930, 58–60.</ref>",
"Сим. Д. Т." : "<ref name='Драгутин Т. Симоновић, Птице, I'>Драгутин Т. Симоновић, Птице, I, Грабљивице, пузачице, викачице, издање Задруге професорског друштва, Београд 1939. и друго издање, Знање, Београд 1953.</ref>",
"Скок" : "<ref name='Петар Скок, Етимологијски рјечник хрватскога или српскога језика, I–IV'>Петар Скок, Етимологијски рјечник хрватскога или српскога језика, I–IV,  ЈАЗУ, Загреб 1971–1974.</ref>",
"СН" : "<ref name='В. Ф. Васић – Д. В. Симић – Ж. Станимировић – М. Каракашевић – М. Шћибан – М. Ружић – С. Кулић – М. Кулић – С. Пузовић, Српска номенклатура I'>В. Ф. Васић – Д. В. Симић – Ж. Станимировић – М. Каракашевић – М. Шћибан – М. Ружић – С. Кулић – М. Кулић – С. Пузовић, Српска номенклатура I, Двоглед, бр. 4, Лига за орнитолошку акцију Србије и Црне Горе, Београд 2004, 7–19 и Српска номенклатура II, Двоглед, бр. 5, Лига за орнитолошку акцију Србије и Црне Горе Београд 2005, 10–18.</ref>",
"ССМ" : "<ref name='Грађа за фауну Старе Србије и Маћедоније, прештампано из часописа Просветни гласник, Музеј Српске земље, посебно издање 6'>Грађа за фауну Старе Србије и Маћедоније, прештампано из часописа Просветни гласник, Музеј Српске земље, посебно издање 6, Државна штампарија Краљевине Србије, Београд 1907.</ref>",
"Стан. Ј." : "<ref name='Ј. Стантић, На македонским водама'>Ј. Стантић, На македонским водама, Ловац, бр. 5, Савез ловачких удружења, Београд 1950, 7–12.</ref>",
"Сто. А." : "<ref name='Атанасије Стојковић, Физика'>Атанасије Стојковић, Физика, Будим 1803.</ref>",
"Сто. Д." : "<ref name='Душан Стојићевић, Научна имена српско-хрватских птица'>Душан Стојићевић, Научна имена српско-хрватских птица, сепаратни отисак из Југословенске шуме, бр. 2, Музеј Српске земље, Београд 1938.</ref>",
"Суп" : "<ref name='Саша Маринковић – Бранко Караџић, Суп, Библиотека Фонд за заштиту птица грабљивица, књ. I'>Саша Маринковић – Бранко Караџић, Суп, Библиотека Фонд за заштиту птица грабљивица, књ. I, Институт за билошка истраживања „Синиша Станковић”, Београд 2008.</ref>",
"ТДР" : "<ref name='Јакша Динић, Тимочки дијалекатски речник'>Јакша Динић, Тимочки дијалекатски речник, Институт за српски језик САНУ, Београд 2008.</ref>",
"Трст. Д. I" : "<ref name='Животиње, V део'>Животиње, V део, Даворин Трстењак, Птице, I свезак, књ. LXIX, Друштво Св. Јеронима, Загреб 1888.</ref>",
"Трст. Д. II" : "<ref name='Животиње, VI део'>Животиње, VI део, Даворин Трстењак, Птице, II свезак, књ. LXXVII, Друштво Св. Јеронима, Загреб 1890.</ref>",
"Трст. Д. III" : "<ref name='Животиње, VII део'>Животиње, VII део, Даворин Трстењак, Птице, III свезак, књ. LXXXX, Друштво Св. Јеронима, Загреб 1893.</ref>",
"Трст. Д. IV" : "<ref name='Животиње, VIII део'>Животиње, VIII део, Даворин Трстењак, Птице, IV свезак, књ. XCVII, Друштво Св. Јеронима, Загреб 1895.</ref>",
"ФЗЦГ" : "<ref name='Вукић Пулевић – Новица Самарџић, Фитоними и зооними у топонимији Црне Горе'>Вукић Пулевић – Новица Самарџић, Фитоними и зооними у топонимији Црне Горе, ДАНУ, Подгорица 2003.</ref>",
"Финк" : "<ref name='Алфред Едмунд Брем, Како живе животиње (по оригиналном пучком издању приредио с особитим обзиром на наш животињски свијет проф. др Никола Финк)'>Алфред Едмунд Брем, Како живе животиње (по оригиналном пучком издању приредио с особитим обзиром на наш животињски свијет проф. др Никола Финк), Минерва, Загреб 1937.</ref>",
"Фир. Љ. I" : "<ref name='Људевит Фирер, Једна година орнитолошког изучавања у Црној Гори, Гласник земаљског музеја у Босни и Херцеговини, књ. VI'>Људевит Фирер, Једна година орнитолошког изучавања у Црној Гори, Гласник земаљског музеја у Босни и Херцеговини, књ. VI, Сарајево 1894, 543–608.</ref>",
"Фир. Љ. II" : "<ref name='Људевит Фирер, Продужена посматрања на орнитолошком пољу у Црној Гори, Гласник земаљског музеја у Босни и Херцеговини, књ. VII'>Људевит Фирер, Продужена посматрања на орнитолошком пољу у Црној Гори, Гласник земаљског музеја у Босни и Херцеговини, књ. VII, Сарајево 1895, 241–258.</ref>",
"ФЈ" : "<ref name='Сергије Д. Матвејев, Фауна Југославије, сепарат, Енциклопедија Југославије, св. IV'>Сергије Д. Матвејев, Фауна Југославије, сепарат, Енциклопедија Југославије, св. IV, Лексикографски завод ФНРЈ, Загреб 1960.</ref>",
"Фрач. М." : "<ref name='Миша Т. Фрачковић, Јестаственица за школу и домаћу наставу (по Гертнеру)'>Миша Т. Фрачковић, Јестаственица за школу и домаћу наставу (по Гертнеру), Књижара браће Јовановића, Панчево 1874.</ref>",
"Хајдучица" : "",
"Хирц Д." : "<ref name='Драгутин Хирц, Грађа за народну номенклатуру и терминологију животиња (III, Птице)'>Драгутин Хирц, Грађа за народну номенклатуру и терминологију животиња (III, Птице), Наставни вјесник, часопис за средње школе, књ. VII, Краљевска хрватско-славонско-далматинска земаљска влада, Загреб 1899, 145–155.</ref>",
"Хирц М." : "<ref name='Мирослав Хирц, Рјечник народних зоологичких назива, књига друга: Птице (Aves)'>Мирослав Хирц, Рјечник народних зоологичких назива, књига друга: Птице (Aves), ЈАЗУ, Загреб 1938–1947.</ref>",
"ЦЛПВ" : "<ref name='Борис Гаровников – Иштван Хам, Прва „црвена листа” птица Војводине, Природа Војводине, VI–VII'>Борис Гаровников – Иштван Хам, Прва „црвена листа” птица Војводине, Природа Војводине, VI–VII, Покрајински завод за заштиту природе, Нови Сад 1980–1981, 59–63. и Борис Гаровников – Иштван Хам, Прва „црвена листа” птица Војводине (прве допуне и корекције), Природа Војводине, IX–XI, Покрајински завод за заштиту природе, Нови Сад 1986, 59–63.</ref>",
"ЦР" : "<ref name='Радосав Стојановић, Црнотравски речник, Српски дијалектолошки зборник, књ. LVII'>Радосав Стојановић, Црнотравски речник, Српски дијалектолошки зборник, књ. LVII, САНУ – Институт за српски језик САНУ, Београд 2010.</ref>",
"Црн. К." : "<ref name='Коста Црногорац, Природна историја, део 1'>Коста Црногорац, Природна историја, део 1, Зоологија, Државна штампарија, Београд 1870.</ref>",
"Чор. Р." : "<ref name='Csornai Rihárd, Bácska madarainak szerb és horvátnyelvü névjegyzéke, Aquila (A magyar királyi Madártani Intézet folyóirata)'>Csornai Rihárd, Bácska madarainak szerb és horvátnyelvü névjegyzéke, Aquila (A magyar királyi Madártani Intézet folyóirata), L évfolyam, Budapest 1943, 394–402.</ref>",
"Џај. А." : "<ref name='Анто Џаја, Ружевац нестао заувек, Зов, бр. 15'>Анто Џаја, Ружевац нестао заувек, Зов, бр. 15, Борба, Београд 1984, 10.</ref>",
"Шев. А." : "<ref name='Александар Шевић, Извештај о раду, Војвођански ловац, бр. 23–24'>Александар Шевић, Извештај о раду, Војвођански ловац, бр. 23–24, Нови Сад 1948, 311–323.</ref>"}

BOOK = 'Дејан Милорадов – Слободан Пузовић – Васа Павковић – Јавор Рашајски, Орнитолошки речник, Имена птица, Матица српска, Нови Сад.'

class Entry():
    def __init__(self, name):
        self.name = name
        self.synonyms = []
        
class Latin_genus(Entry):
    def __init__(self, name):
        self.hyponyms = []
        
class Serbian_genus(Entry):
    def __init__(self, name):
        self.latin_names = None
        self.hyponyms = []
    
class Latin_species(Entry):
    def __init__(self, name):
        self.srb_genus = None
        self.lat_genus = None
        self.hyperonyms = []
        
class Serbian_species(Entry):
    def __init__(self, name):
        self.srb_genus = None
        self.lat_genus = None
        self.hyperonyms = []

def find_duplicate_keys(d, no_of_dup):
    """
    Read dictionary keys and figure out which are duplicates. Store them in a
    txt file. If the file exists it skips this step and reads the file.
    """
    if os.path.isfile("duplicates.txt"):
        duplicates = open("duplicates.txt", "r", encoding="utf8").read().split()
        return duplicates
    else:
        all_keys = d.keys()
        all_keys_list = [re.sub(r'\{[^}]*\}', '', x).strip() for x in all_keys]
        ordered_keys = Counter(all_keys_list).most_common(no_of_dup)
        duplicates = ([x[0] for x in ordered_keys if x[1] > 1])
        outfile = open("out/duplicates.txt", "w", encoding="utf8")
        outfile.write("\n".join(duplicates))
        return duplicates
    
def get_type_of_entry(dictionary, s, entry):
    """
    Transfering entries from parsing class to wiki class.
    """
    return entry
    
def concat_entry(string):
    return string
    
def format_latin_species(species):
    
    return species
    
def format_serbian_species(species, spec):
    spec_string = []
    for s in species:
        if s != spec:
            refs = s[1].split(';')
            refs = [x.strip() for x in refs]
            refs = [x for x in refs if x != '']
            print(refs)
            refs = [REFERENCES[x] for x in refs]
            refs = ' '.join(refs)
            spec_string.append(s[0] + ' ' + refs + ' ' + BOOK + '\n')
    return ''.join(spec_string)

def expand_dictionary(dictionary):
    dict_of_wiki_entries = {}
    for k in dictionary:
        all_srb_spec = {}
        all_lat_spec = {}
        
        genus_lat_name = ' '.join([k, dictionary[k][k]['latin name'], dictionary[k][k]['discoverer']])
        if dictionary[k][k]['serbian name'] != []:
            genus_serbian_name = dictionary[k][k]['serbian name'][0][0] #+ ' ' + REFERENCES[dictionary[k][k]['latin name'][1]]
        
        for i, spec in enumerate(dictionary[k][k]['species']):
            latin_species = dictionary[k][k]['species'][spec][1]
            latin_species = format_latin_species(latin_species)
            all_lat_spec[i] = latin_species
            serbian_species = dictionary[k][k]['species'][spec][2]
            for spec in serbian_species:

                serbian_synonyms = format_serbian_species(serbian_species, spec[0])
                serb_spec = Serbian_species(spec[0])
                serb_spec.synonyms = serbian_synonyms
            
        lat_gen_entry = Latin_genus(genus_lat_name)
        lat_gen_entry.hyponyms = all_lat_spec
        for srb_spec in genus_serbian_name:
            srb_gen_entry = Serbian_genus(srb_spec[0])
            srb_genus_synonym = [x for x in genus_serbian_name if x[0] != srb_spec[0]]
            srb_gen_entry.synonyms = srb_genus_synonym
            srb_gen_entry.hyponyms = all_srb_spec
            srb_gen_entry.latin_names = genus_lat_name
            dict_of_wiki_entries[srb_spec[0]] = srb_gen_entry
        
    return dict_of_wiki_entries